{
  "usuarios": [
    {
      "nomeUsuario": "teste",
      "emailUsuario": "teste@gmail.com",
      "senhaUsuario": "12345",
      "receitasFavoritas": [
        0,
        1
      ],
      "id": 1
    }
  ],
  "receitas": [
    {
      "id": 0,
      "nomeReceita": "Salmão grelhado light",
      "imagemReceita": "../images/receitas-img/receita0.jpg",
      "ingredientesReceita": [
        "2 filés de salmão",
        "2 limões",
        "Sal a gosto",
        "1 colher de chá de pasta de alho",
        "50ml de azeite de oliva",
        "Coentro a gosto."
      ],
      "modoPreparoReceita": [
        "Esprema o suco dos limões. Tempere os filés de salmão no suco dos limões e um pouco de sal, deixe na geladeira de um dia para o outro.\n\nPouco antes de grelhar o salmão, junte o coentro picado, o alho, o azeite de oliva e uma pitada de sal em uma tigela. Misture para obter um molhinho.\n\nCom o auxílio de um raminho de coentro, pincele os filés de salmão com o molho. Leve os filés em uma frigideira ao fogo para grelhar. Pincele o peixe com o molho toda vez que virar.\n\nNa última virada, despeje o restante do molho por cima dos filés de salmão. Deixe dourar mais um pouquinho para aderir bem e estará pronto."
      ],
      "tempoDePreparo": "30min",
      "custoReceita": 3
    },
    {
      "id": 1,
      "nomeReceita": "Panqueca de banana e aveia",
      "imagemReceita": "../images/receitas-img/receita1.jpg",
      "ingredientesReceita": [
        "2 colheres de sopa de farinha de aveia",
        "1 colher de sopa de linhaça ou farinha de linhaça",
        "1 pitada de adoçante culinário (opcional)",
        "2 claras",
        "1 banana bem madura",
        "Óleo de coco para untar frigideira."
      ],
      "modoPreparoReceita": [
        "Em uma tigela, misture a aveia e a linhaça. Caso queira deixar mais docinho, acrescente o adoçante.\n\nAmasse a bananas.\n\nJunte as claras e as bananas amassadas com a mistura de aveia e linhaça, e mexa bem até que a massa fique homogênea.\n\nEm uma frigideira, passe 1/2 colher de chá de óleo de coco, coloque uma pequena porção da massa e espere dourar um lado. Quando um lado estiver douradinho, repita o processo com o outro lado. Coloque em um prato e sirva com algum complemento."
      ],
      "tempoDePreparo": "15min",
      "custoReceita": 1
    }
  ]
}